In [216]:
# Data Manipulation with Pandas

# pd is built on top of numpy - dealing with dataframe effectively and efficiently

# 这个文档 介绍 pandas


import numpy as np
import pandas as pd

In [217]:
# Combining Datasets: Concat and Append

# 作为例子，这里我们创建 一个function，这个func用来创建一个dataframe
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [218]:
def make_df1 (cols, ind) :
    data2 = {c:[str(c) + str(i) for i in ind] for c in cols}
    return data2
xx1 = make_df1('ABCD', range(3,5))

data1 = pd.DataFrame(xx1)
print(data1)

    A   B   C   D
0  A3  B3  C3  D3
1  A4  B4  C4  D4

In [219]:
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [220]:
x = [[1, 2],[3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [221]:
x = [[1, 2],[3, 4]]
np.concatenate([x, x], axis=0)

array([[1, 2],
       [3, 4],
       [1, 2],
       [3, 4]])

In [222]:
# Simple Concatenation with pd.concat

# pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False,
# keys=None, levels=None, names=None, verify_integrity=False,
# copy=True)

ser1 = pd.Series(['A','B','C'], index = [1,2,3])
ser2 = pd.Series(['D','E','E'], index = [4,5,6])
ser2a = pd.Series(['D','E','E'], index = [1,2,3])
print(pd.concat([ser1, ser2]))
print(pd.concat([ser1, ser2a], axis=0))
print(pd.concat([ser1, ser2a], axis=1))

1    A
2    B
3    C
4    D
5    E
6    E
dtype: object
1    A
2    B
3    C
1    D
2    E
3    E
dtype: object
   0  1
1  A  D
2  B  E
3  C  E

In [223]:
ser1a = ser1.reset_index()
ser2a = ser2.reset_index()

In [224]:
print(ser1a)
print(ser2a)
print(ser1a.shape)

   index  0
0      1  A
1      2  B
2      3  C
   index  0
0      4  D
1      5  E
2      6  E
(3, 2)

In [225]:
new1 = pd.concat([ser1a, ser2a], axis=1)
new1

   index  0  index  0
0      1  A      4  D
1      2  B      5  E
2      3  C      6  E

In [226]:
new1.rename(columns={'A':'original index', 'B': 'xx1'})
print(new1)

   index  0  index  0
0      1  A      4  D
1      2  B      5  E
2      3  C      6  E

In [227]:
df1 = make_df('AB',[1,2])
df2 = make_df('AB', [3,4])
print(df1)
print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [228]:


df1a = df1.reset_index()
df2a = df2.reset_index()

print(df1a)
print(df2a)

print(pd.concat([df1a, df2a], axis=1))

print(pd.concat([df1, df2], axis=1))

   index   A   B
0      1  A1  B1
1      2  A2  B2
   index   A   B
0      3  A3  B3
1      4  A4  B4
   index   A   B  index   A   B
0      1  A1  B1      3  A3  B3
1      2  A2  B2      4  A4  B4
     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

In [229]:
# Duplicate indices
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])

In [230]:
x, y

(    A   B
 0  A0  B0
 1  A1  B1,
     A   B
 2  A2  B2
 3  A3  B3)

In [231]:
y.index = x.index

In [232]:
x, y

(    A   B
 0  A0  B0
 1  A1  B1,
     A   B
 0  A2  B2
 1  A3  B3)

In [233]:
print(pd.concat([x,y], axis=1))

    A   B   A   B
0  A0  B0  A2  B2
1  A1  B1  A3  B3

In [234]:
try:
    pd.concat([x, y], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

In [235]:
# Duplicate indices
x = make_df('AB', [0, 1])
y = make_df('CD', [2, 3])
print(x)
print(y)
print(pd.concat([x,y],axis=0))

    A   B
0  A0  B0
1  A1  B1
    C   D
2  C2  D2
3  C3  D3
     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [236]:
print(pd.concat([x,y], ignore_index=True))

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [237]:
# Adding MultiIndex keys. 可以增加一个index用于区别数值来自于之前哪个df
print(x); print(y); print(pd.concat([x, y], keys=['xx','yy']))

    A   B
0  A0  B0
1  A1  B1
    C   D
2  C2  D2
3  C3  D3
        A    B    C    D
xx 0   A0   B0  NaN  NaN
   1   A1   B1  NaN  NaN
yy 2  NaN  NaN   C2   D2
   3  NaN  NaN   C3   D3

In [238]:
# Concatenation with joins，当不同的df有不同的columns的时候，我们需要用到join
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])


print(df5); print(df6); 


# print(pd.concat([df5, df6])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

In [239]:
print(pd.concat([df5, df6]))

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [240]:
print(pd.concat([df5, df6], join='inner'))

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [241]:
print(df5); print(df6);
print(pd.concat([df5, df6], join='outer'))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [242]:
# The append() method
print(df1,df2)

    A   B
1  A1  B1
2  A2  B2     A   B
3  A3  B3
4  A4  B4

In [243]:
print(df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [244]:
print(pd.concat([df1,df2,df2], axis=0))

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
3  A3  B3
4  A4  B4

In [245]:
# # Combining Datasets: Merge and Join 
# 我们有不同的join的方式
# One-to-one joins 其实就是merge

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})

In [246]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [247]:
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
'hire_date': [2004, 2008, 2012, 2014]})
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [248]:
print(pd.concat([df1, df2], axis=1, join= 'outer'))

  employee        group employee  hire_date
0      Bob   Accounting     Lisa       2004
1     Jake  Engineering      Bob       2008
2     Lisa  Engineering     Jake       2012
3      Sue           HR      Sue       2014

In [249]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [250]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
'supervisor': ['Carly', 'Guido', 'Steve']})

df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [251]:

print(df3); print(df4);

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [252]:
print(pd.merge(df3, df4))

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [253]:
# many to many join 
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
'Engineering', 'Engineering', 'HR', 'HR'],
 'skills': ['math', 'spreadsheets', 'coding', 'linux',
'spreadsheets', 'organization']})

In [254]:
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [255]:
print(df1); print(df5)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [256]:
print(pd.merge(df1, df5)) # pd 会自动补全，保留所有信息

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [257]:
# Specification of the Merge Key
print(df1); print(df2) ; print(pd.merge(df1, df2)); 
print(pd.merge(df1, df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [258]:
# The left_on and right_on keywords ，merge两个df，我们可以指定merge时各自跟从不同的index
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'salary': [70000, 80000, 120000, 90000]})
print(df1); print(df3);
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [259]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [260]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop(2, axis=0)

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
3      Sue           HR   Sue   90000

In [261]:
# The left_index and right_index keywords

df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a); print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [262]:
print(pd.merge(df1a, df2a, left_index=True, right_index=True))

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [263]:
print(df1a.join(df2a))

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [264]:
print(pd.merge(df1a, df2a, left_on='employee', right_on='employee'))

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [265]:
print(df1a); print(df3);
print(pd.merge(df1a, df3, left_index=True, right_on='name'))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [266]:
print(pd.merge(df1a, df3, left_on='employee', right_on='name'))

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [267]:
# Specifying Set Arithmetic for Joins
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
'food': ['fish', 'beans', 'bread']},
columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
'drink': ['wine', 'beer']},
columns=['name', 'drink'])
print(df6); print(df7); print(pd.merge(df6, df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

In [268]:
pd.merge(df6, df7, how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [269]:
print(df6); print(df7); print(pd.merge(df6, df7, how='left'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [270]:
# Overlapping Column Names: The suffixes Keyword
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'rank': [1, 2, 3, 4]})

In [271]:
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [272]:
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'rank': [3, 1, 4, 2]})
print(df8); print(df9); print(pd.merge(df8, df9, on="name"))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [273]:
# 在merge的时候，可能会出现variable重名的情况，可以用suffixes避免
print(df8); print(df9);
print(pd.merge(df8, df9, on="name", suffixes=["_L", "_R"]))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [274]:
# 一个例子 us state data 

!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 57935  100 57935    0     0  57935      0  0:00:01 --:--:--  0:00:01  725k
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   835  100   835    0     0    835      0  0:00:01 --:--:--  0:00:01 17765
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   872  100   872    0     0    872      0  0:00:01 --:--:--  0:00:01 18553

In [275]:
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')
print(pop.head()); print(areas.head()); print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [276]:
merged = pd.merge(abbrevs, areas, how='outer')
merged = pd.merge(merged, pop, left_on='abbreviation', right_on='state/region').drop('abbreviation', axis= 1)
merged.head()

     state  area (sq. mi) state/region     ages  year  population
0  Alabama          52423           AL  under18  2012   1117489.0
1  Alabama          52423           AL    total  2012   4817528.0
2  Alabama          52423           AL  under18  2010   1130966.0
3  Alabama          52423           AL    total  2010   4785570.0
4  Alabama          52423           AL  under18  2011   1125763.0

In [277]:
merged.isnull().any() #找出有哪些row是null value

state            False
area (sq. mi)    False
state/region     False
ages             False
year             False
population       False
dtype: bool

In [278]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array([], dtype=object)

In [279]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state            False
area (sq. mi)    False
state/region     False
ages             False
year             False
population       False
dtype: bool

In [280]:
merged[merged['population'].isnull()]

Empty DataFrame
Columns: [state, area (sq. mi), state/region, ages, year, population]
Index: []

In [281]:
final = pd.merge(merged, areas, on='state', how='left')
final.head()

,state,area (sq. mi)_x,state/region,ages,year,population,area (sq. mi)_y
0,Alabama,52423,AL,under18,2012,1117489.0,52423
1,Alabama,52423,AL,total,2012,4817528.0,52423
2,Alabama,52423,AL,under18,2010,1130966.0,52423
3,Alabama,52423,AL,total,2010,4785570.0,52423
4,Alabama,52423,AL,under18,2011,1125763.0,52423

In [282]:
final.isnull().any()

state              False
area (sq. mi)_x    False
state/region       False
ages               False
year               False
population         False
area (sq. mi)_y    False
dtype: bool

In [284]:
final['state'][final['area (sq. mi)_y'].isnull()].unique()

array([], dtype=object)

In [285]:
final.dropna(inplace = True)
final.head()

,state,area (sq. mi)_x,state/region,ages,year,population,area (sq. mi)_y
0,Alabama,52423,AL,under18,2012,1117489.0,52423
1,Alabama,52423,AL,total,2012,4817528.0,52423
2,Alabama,52423,AL,under18,2010,1130966.0,52423
3,Alabama,52423,AL,total,2010,4785570.0,52423
4,Alabama,52423,AL,under18,2011,1125763.0,52423

In [286]:
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

,state,area (sq. mi)_x,state/region,ages,year,population,area (sq. mi)_y
3,Alabama,52423,AL,total,2010,4785570.0,52423
91,Alaska,656425,AK,total,2010,713868.0,656425
101,Arizona,114006,AZ,total,2010,6408790.0,114006
189,Arkansas,53182,AR,total,2010,2922280.0,53182
197,California,163707,CA,total,2010,37333601.0,163707

In [288]:
data2010.set_index('state', inplace=True)
density = data2010['population'] / data2010['area (sq. mi)_y']
density.sort_values(ascending=False, inplace=True)
density.head()

KeyError: "None of ['state'] are in the columns"

In [ ]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

In [ ]:
# Aggregation and Grouping
# Planets Data
import seaborn as sns

planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [ ]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [ ]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [ ]:
ser.sum()

2.811925491708157

In [ ]:
ser.mean()

0.5623850983416314

In [ ]:
df= pd.DataFrame({'A': rng.rand(5), 'B':rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [ ]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [ ]:
df.mean(1)

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [ ]:
df.mean(axis=1)

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [ ]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [ ]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [ ]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'], 'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [ ]:
df.groupby('key').median()

     data
key
A     1.5
B     2.5
C     3.5

In [ ]:
planets.groupby('method')['mass','orbital_period'].median() # 以method 分组，取mass以及orbital_period这2个variable 的中位数

<ipython-input-276-65ec60ccb32c>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  planets.groupby('method')['mass','orbital_period'].median() # 以method 分组，取mass以及orbital_period这2个variable 的中位数

                                mass  orbital_period
method
Astrometry                       NaN      631.180000
Eclipse Timing Variations      5.125     4343.500000
Imaging                          NaN    27500.000000
Microlensing                     NaN     3300.000000
Orbital Brightness Modulation    NaN        0.342887
Pulsar Timing                    NaN       66.541900
Pulsation Timing Variations      NaN     1170.000000
Radial Velocity                1.260      360.200000
Transit                        1.470        5.714932
Transit Timing Variations        NaN       57.011000

In [ ]:
# Iteration over groups.
for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [ ]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [ ]:
planets.groupby('method')['year'].describe().unstack().head()

       method
count  Astrometry                        2.0
       Eclipse Timing Variations         9.0
       Imaging                          38.0
       Microlensing                     23.0
       Orbital Brightness Modulation     3.0
dtype: float64

In [ ]:
# Aggregate, filter, transform, apply
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'], 'data1': range(6),'data2': rng.randint(0, 10, 6)},columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [ ]:
df.groupby('key').sum()

     data1  data2
key
A        3      8
B        5      7
C        7     12

In [ ]:
# aggregate() is more flexible than .sum()

df.groupby('key').aggregate(['min', np.median,max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [371]:
# filtering 
def filter_func(x):
    return x['data2'].std() > 4
print(df); print(df.groupby('key').std());
print(df.groupby('key').filter(filter_func))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641
  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [295]:
df.loc[:,'data2']>2

0    5
1    0
2    3
3    3
4    7
5    9
Name: data2, dtype: int64

In [297]:
df[df.loc[:,'data2']>2]

  key  data1  data2
0   A      0      5
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [298]:
df.filter(df.loc[:,'data2']>2)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [372]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [373]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x
print(df); print(df.groupby('key').apply(norm_by_data2))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

In [379]:
# Specifying the split key
# A list, array, series, or index providing the grouping keys.
L = [0, 1, 0, 1, 2, 0]
print(df); print(df.groupby(L).sum())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
   data1  data2
0      7     17
1      4      3
2      4      7

In [380]:
print(df); print(df.groupby(df['key']).sum())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
     data1  data2
key
A        3      8
B        5      7
C        7     12

In [382]:
# A dictionary or series mapping index to group.
df2 = df.set_index('key')
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
print(df2); 
print(df2.groupby('key').sum()) ;
print(df2.groupby(mapping).sum())

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9
     data1  data2
key
A        3      8
B        5      7
C        7     12
           data1  data2
key
consonant     12     19
vowel          3      8

In [383]:
print(df2); print(df2.groupby(str.lower).mean())

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9
     data1  data2
key
a      1.5    4.0
b      2.5    3.5
c      3.5    6.0

In [384]:
df2.groupby([str.lower, mapping]).mean()

               data1  data2
key key
a   vowel        1.5    4.0
b   consonant    2.5    3.5
c   consonant    3.5    6.0

In [388]:
# Grouping example
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
print(type(decade))
print(decade)
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)
planets.groupby(['method', decade])['number'].sum().fillna(0)

<class 'pandas.core.series.Series'>
0       2000s
1       2000s
2       2010s
3       2000s
4       2000s
        ...
1030    2000s
1031    2000s
1032    2000s
1033    2000s
1034    2000s
Name: decade, Length: 1035, dtype: object

method                         decade
Astrometry                     2010s       2
Eclipse Timing Variations      2000s       5
                               2010s      10
Imaging                        2000s      29
                               2010s      21
Microlensing                   2000s      12
                               2010s      15
Orbital Brightness Modulation  2010s       5
Pulsar Timing                  1990s       9
                               2000s       1
                               2010s       1
Pulsation Timing Variations    2000s       1
Radial Velocity                1980s       1
                               1990s      52
                               2000s     475
                               2010s     424
Transit                        2000s      64
                               2010s     712
Transit Timing Variations      2010s       9
Name: number, dtype: int64